Revit 2027 API
PathOfTravel.RemoveWaypoint Method
 Remove a waypoint.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveWaypoint(
	int index
)
Public Sub RemoveWaypoint (
	index As Integer
)
public:
void RemoveWaypoint(
	int index
)
member RemoveWaypoint :
        index : int -> unit
Parameters
index Int32
 The index of the waypoint to remove.
Exceptions
Exception | Condition
InvalidOperationException |  Index refers to a non-existent waypoint. -or- This functionality is not available in Revit LT. -or- Cannot perform this operation for a path of travel in a group.
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace